# Жизненный цикл роли пользователей

## 1. Параметры жизненного цикла

- **Код жизненного цикла**: user-role
- **Объект**: Role

## 2. Диаграмма состояний

<div style="text-align: center;">
<a href="/images/workflow/diagrams-svg/user-role.svg" target="_blank">
<img src="/images/files/workflow/diagrams-svg/user-role.svg" alt="user-role" style="max-height: 300px; cursor: pointer;" title="Кликните для увеличения">
</a>
</div>

## 3. Состояния

| Наименование | Код | Описание | Доступные действия |
|--------------|-----|----------|-------------------|
| Активна | `active` | Активная роль пользователей | Редактировать, Удалить |
| Удалена | `deleted` | Удаленная роль пользователей | *Не определены* |

## 4. Действия

| Наименование | Код | Описание | Тип |
|--------------|-----|----------|-----|
| Просмотреть роли | `list` | Просмотр реестра ролей пользователей оператором | Глобальное |
| Просмотреть роли | `employee-role-list` | Просмотреть реестр ролей пользователей пользователем организации | Глобальное |
| Добавить роль | `add` | Добавить роль пользователей организации | Инициализирующие |
| Редактировать | `edit` | Редактировать роль пользователей организации | Действие состояния |
| Удалить | `delete` | Удалить роль пользователей организации | Действие состояния |

## 5. Матрица доступности действий

| Действие / Статус | Активна | Удалена |
|:---------|:---------:|:---------:|
| **Редактировать (`edit`)** | ✅ |  |
| **Удалить (`delete`)** | ✅ |  |

